# Get Method (Document, Guid)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Alignment..::..Get Method (Document, Guid)
Alignment Class See Also
---
Returns an Alignment in the document given its GUID.
**Namespace:** Autodesk.Revit.DB.Infrastructure**Assembly:** Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021.1
# Syntax
C#
---
```text
public static Alignment Get(
	Document document,
	Guid guid
)
```

Visual Basic
---
```text
Public Shared Function Get ( _
	document As Document, _
	guid As Guid _
) As Alignment
```

Visual C++
---
```text
public:
static Alignment^ Get(
	Document^ document,
	Guid guid
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..DocumentThe document for which the alignment is returned.
guid
    Type: System..::..GuidThe unique identifier of the Alignment.
# See Also
Alignment Class
Get Overload
Autodesk.Revit.DB.Infrastructure Namespace